#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
google_compute_instance.server03: Refreshing state... [id=projects/iac-trabalho-1/zones/us-central1-c/instances/server03]
google_compute_instance.server02: Refreshing state... [id=projects/iac-trabalho-1/zones/us-central1-c/instances/server02]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.server02 will be updated in-place
  ~ resource "google_compute_instance" "server02" {
        id                      = "projects/iac-trabalho-1/zones/us-central1-c/instances/server02"
      ~ metadata                = {
          - "ssh-keys" = <<-EOT
                juliavit1999:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBEQCeAGKj56AEiIMBI8Cghpdvo9RyEuvK3oAWzVdYFin8jj2j8RmpFbvwTyX/GjIEoL4CrNntxKAcIwsjoKtPDI= google-ssh {"userName":"juliavit1999@gmail.com","expireOn":"2022-11-16T23:34:54+0000"}
                juliavit1999:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDFfIi2uwznTlGTJR+hXx7zXmeRnv+42ZEcqj+l0Lq4UGVcJ60ml6tANzEM0OZUiY41NzGFuZqf1BnSqZ+gPU8zMSzeREQWN1N2e3sEFpLY8FmTCs4/fv4X6rYbw82dJ4mye3M641dNc8EpFJJPR8/BPruAB/H98jVtGmcTMkodPnWVabha7/02zyANXFa6YPK+1sEfzKZ8c3Cr/oIJdJn3IHwm76iyfe6sCICH4cM2daaPr8JdOyZ9y7VeA3G07hBR+CM/OdP62Yixm7j/hZWkPfnkPe9XQa1ly3rPuc2tXYdp1VwALGu+6U14DQ2NuF4hixzcFEVkQhysU58FY36z google-ssh {"userName":"juliavit1999@gmail.com","expireOn":"2022-11-16T23:35:12+0000"}
            EOT -> null
        }
        name                    = "server02"
        tags                    = []
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # google_compute_instance.server03 must be replaced
-/+ resource "google_compute_instance" "server03" {
      ~ cpu_platform            = "AMD Rome" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/iac-trabalho-1/zones/us-central1-c/instances/server03" -> (known after apply)
      ~ instance_id             = "1770347009624561303" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "P9PMOkVDqRU=" -> (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash
            sudo apt-get update
            
            sudo apt-get install openjdk-8-jdk -y
            
            wget -q -O - https://pkg.jenkins.io/debian-stable/jenkins.io.key | sudo apt-key add -
            
            sudo sh -c 'echo deb https://pkg.jenkins.io/debian-stable binary/ > /etc/apt/sources.list.d/jenkins.list'
            
            sudo apt-get update
            
            sudo apt-get install jenkins -y
            
            
            
        EOT # forces replacement
      + min_cpu_platform        = (known after apply)
        name                    = "server03"
      ~ project                 = "iac-trabalho-1" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/zones/us-central1-c/instances/server03" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
      ~ zone                    = "us-central1-c" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/zones/us-central1-c/disks/server03" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20221018" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/global/networks/default" -> "default"
          ~ network_ip         = "10.128.0.9" -> (known after apply)
          - queue_count        = 0 -> null
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/regions/us-central1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "iac-trabalho-1" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.171.78.31" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart           = true -> (known after apply)
          + instance_termination_action = (known after apply)
          ~ min_node_cpus               = 0 -> (known after apply)
          ~ on_host_maintenance         = "MIGRATE" -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ provisioning_model          = "STANDARD" -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @juliavpaiva, Action: `pull_request`, Working Directory: `gcp/main-infrastructure/`, Workflow: `GCP - Create terraform plan for Main Infrastructure`*